ox_docs/corners/david/20210922123323-category_theory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-24 Fri 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Categories, Logic and Language</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
<link rel="stylesheet" href="https://raw.githubusercontent.com/PrismJS/prism-themes/master/themes/prism-atom-dark.css" crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>
<body>
<div id="preamble" class="status">
<div>Categories, Logic and Language  Taproot 2021-09-24 Fri 13:59</div>
</div>
<div id="content">
<h1 class="title">Categories, Logic and Language</h1>
<p>
:ROAM<sub>REFS</sub>: <a href="https://docs.google.com/presentation/d/1rpqDXysh8GJJodXCTbWCj4MmIx87mT_ksyMqHoq-hkk/edit">https://docs.google.com/presentation/d/1rpqDXysh8GJJodXCTbWCj4MmIx87mT_ksyMqHoq-hkk/edit</a>
</p>

<div id="outline-container-org1d4ed38" class="outline-2">
<h2 id="org1d4ed38"><span class="section-number-2">1</span> <a href="https://www.amazon.com/Logicomix-search-truth-Apostolos-Doxiadis/dp/1596914521">Logicomix</a></h2>
</div>
<div id="outline-container-orgf2f429b" class="outline-2">
<h2 id="orgf2f429b"><span class="section-number-2">2</span> Category Theory</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Very general formalism of <i>objects</i> and <i>morphisms</i> - things and ways to connect them.</li>
<li>Almost like a 'theory of everything' for math.</li>
</ul>
</div>
<div id="outline-container-org5503076" class="outline-3">
<h3 id="org5503076"><span class="section-number-3">2.1</span> Origins</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>At some point Feynman realized that it's useful to draw linear operators as <a href="20210922132026-feynman_diagrams.html">diagrams</a> in a systematic manner.</li>
<li>Later, Penrose realized that this can be applied more broadly. Representing linear operators in a topological/geometric manner became its own field.</li>
<li>Separately, logicians had started using categories where the objects were propositions and morphism were proofs.
<ul class="org-ul">
<li>Programmers started using them where objects are data types and morphism are programs.</li>
</ul></li>
<li>Category theory describes all these things in an abstract manner
<ul class="org-ul">
<li>Focus on approaching these relationships and how to compose them in a way abstracted away from objects</li>
</ul></li>
<li>Curry-Howard correspondence
<ul class="org-ul">
<li>Person that <a href="20210922132544-haskell.html">Haskell</a> is named after</li>
<li>Modeling programs as proofs</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org21c7d81" class="outline-3">
<h3 id="org21c7d81"><span class="section-number-3">2.2</span> Rosetta Stone</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Category Theory</b></td>
<td class="org-left">Physics</td>
<td class="org-left">Topology</td>
<td class="org-left">Logic</td>
<td class="org-left">Computation</td>
</tr>

<tr>
<td class="org-left">object</td>
<td class="org-left">system</td>
<td class="org-left">manifold</td>
<td class="org-left">proposition</td>
<td class="org-left">data type</td>
</tr>

<tr>
<td class="org-left">morphism</td>
<td class="org-left">process</td>
<td class="org-left">cobordism</td>
<td class="org-left">proof</td>
<td class="org-left">program</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4cf46e2" class="outline-3">
<h3 id="org4cf46e2"><span class="section-number-3">2.3</span> Intro to Categories</h3>
<div class="outline-text-3" id="text-2-3">
<div class="defn" id="org578f6b5">
<p>
A <i>category</i> \(C\) consists of:
</p>
<ul class="org-ul">
<li>a collection of <i>objects</i>, where if \(X\) is an object \(X \in C\), and</li>
<li>for every pair of objects \((X,Y)\), there is a set \(\hom(X,Y)\) of morphisms from X to Y We call this set \(\hom(X,Y)\) a <b>homset</b>. If \(f \in  \hom(X,Y)\) then \(f\) maps \(X\) to \(Y\), or more formally, \(f: X \rightarrow Y\)</li>
</ul>
<p>
such that
</p>
<ul class="org-ul">
<li>for every object \(X\) there is an identity morphism that maps \(X\) to \(X\).</li>
<li>morphisms are composable: given \(f: X \to  Y\) and \(g: Y \to  Z\)  there is a morphism \(gf: X \to Z\)</li>
<li>an identity morphism is both a left and a right unit for composition (identities are commutative)</li>
<li>composition is associative</li>
</ul>

<p>
These objects and morphisms could be anything (see <a href="#org21c7d81">2.2</a>). Consider the symbols \(X\) and \(Y\) as sets capable of internal structure.
</p>

</div>

<p>
One example would be Haskell code. Take functions like <code>words</code> as morphisms and data types like strings as objects (objects can be different types!). Our output is another object.
</p>
<div class="org-src-container">
<pre class="src src-haskell">words "Hello World"
-- ["Hello", "World"]
</pre>
</div>
<div class="org-src-container">
<pre class="src src-haskell">length ["I", "like", "cats"]
-- 3
</pre>
</div>
<p>
Just like a normal morphism, we can <i>compose</i> functions in Haskell.
</p>
<div class="org-src-container">
<pre class="src src-haskell">let countwords = length . words
countwords "Yay for composition!"
-- 3
</pre>
</div>

<p>
A more casual definition of a category is a <i>network of composable relationships</i>&#x2026; of anything. The generality of category theory allows it to be useful to a wide variety of fields.
</p>
</div>
</div>
<div id="outline-container-orga508275" class="outline-3">
<h3 id="orga508275"><span class="section-number-3">2.4</span> Functors</h3>
<div class="outline-text-3" id="text-2-4">
<div class="defn" id="orgab036c5">
<p>
A <i>functor</i> \(F:C\to D\) from a category \(C\) to a category \(D\) is a map sending:
</p>
<ul class="org-ul">
<li>any object \(X \in C\) to an object \(F(X) \in D\),</li>
<li>any morphism \(f:X \to Y\) in \(C\) to a morphism \(F(f): F(X) \to F(Y)\) in \(D\)</li>
</ul>
<p>
in such a way that:
</p>
<ul class="org-ul">
<li>\(F\) preserves identities</li>
<li>\(F\) preserves composition</li>
</ul>

<p>
The primary difference here is how functors can act on both objects and morphisms.
</p>

</div>

<div class="note" id="org73bf555">
<p>
In logic, a category is a <i>theory</i> and the functor a <i>model</i> of a theory (allowing you to create a representation in another space).
</p>

</div>
</div>
</div>
<div id="outline-container-org51fe746" class="outline-3">
<h3 id="org51fe746"><span class="section-number-3">2.5</span> Natural Transformation</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Gives us a way to turn functors into one another.
</p>

<div class="defn" id="org2b6304c">
<p>
Given two functors \(F,F' : C \to D\) a natural transformation \(\alpha : F \Rightarrow F'\) assigns to every object X in C a morphism \(\alpha_x : F(x) \to F'(X)\) such that for any morphism \(f: X \to Y\) in \(C\), the equation \(\alpha_y F(f) = F'(f)\alpha_x\) holds in \(D\).
</p>

</div>
</div>
</div>

<div id="outline-container-orgd24231d" class="outline-3">
<h3 id="orgd24231d"><span class="section-number-3">2.6</span> Types of Categories</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org4e71b5a" class="outline-4">
<h4 id="org4e71b5a"><span class="section-number-4">2.6.1</span> Monoidal Categories&#xa0;&#xa0;&#xa0;<span class="tag"><span class="review">review</span></span></h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
A monoidal category has a function \(\otimes : C \times C \to C\) (a product of categories outputs pairs of morphisms and pairs of objects??) that takes two objects and puts them together to give a new object \(X\otimes Y\). This allows execution of morphisms in <i>parallel</i> or <i>series</i> by acting on pairs.
</p>
</div>
</div>
<div id="outline-container-org0a173ff" class="outline-4">
<h4 id="org0a173ff"><span class="section-number-4">2.6.2</span> Braided Monoidal Categories&#xa0;&#xa0;&#xa0;<span class="tag"><span class="unresearched">unresearched</span></span></h4>
</div>
<div id="outline-container-org0699b34" class="outline-4">
<h4 id="org0699b34"><span class="section-number-4">2.6.3</span> Closed Categories&#xa0;&#xa0;&#xa0;<span class="tag"><span class="unresearched">unresearched</span></span></h4>
<div class="outline-text-4" id="text-2-6-3">
<p>
hom(X &otimes; Y, Z) \approxeq hom(Y,X 
Idea of turning an operation into an object? Connection to <a href="20210922143034-currying.html">currying</a>.
</p>
</div>
</div>
</div>


<div id="outline-container-org431c49d" class="outline-3">
<h3 id="org431c49d"><span class="section-number-3">2.7</span> Lambda Calculus&#xa0;&#xa0;&#xa0;<span class="tag"><span class="unresearched">unresearched</span></span></h3>
<div class="outline-text-3" id="text-2-7">
</div>
</div>
</div>
</div>
</body>
</html>
